leetcode_2447_number_of_subarrays_with_gcd_equal_to_k.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2447. Number of Subarrays With GCD Equal to K</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2447. Number of Subarrays With GCD Equal to K</h1>
<p>
<a href="https://leetcode.com/problems/number-of-subarrays-with-gcd-equal-to-k/">Problem Statement</a>
</p>

<div id="outline-container-org1c2ce0d" class="outline-2">
<h2 id="org1c2ce0d">Understand the problem</h2>
<div class="outline-text-2" id="text-org1c2ce0d">
<p>
Given an array of integers \(a\) and an integer \(k\), find all subarrays \(a[i..j]\) where \(gcd(a[i], a[i+1], ..., a[j])=k\).
</p>
</div>
</div>

<div id="outline-container-org20b9980" class="outline-2">
<h2 id="org20b9980">Devise a plan</h2>
<div class="outline-text-2" id="text-org20b9980">
<p>
<a href="pattern_small_constraints_could_allow_brute_force_solution.html#ID-BC81A358-FBCC-43AA-9928-E9778A107869">Pattern: Small constraints could allow a brute-force solution</a>, so iterate over all subarrays and compute GCD.
</p>
</div>

<div id="outline-container-org1c8ff75" class="outline-3">
<h3 id="org1c8ff75">Carry out the plan</h3>
<div class="outline-text-3" id="text-org1c8ff75">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">subarrayGCD</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], k: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(nums)
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">if</span> nums[i] == k:
                ans += 1
            cur = nums[i]
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(i + 1, N):
                cur = math.gcd(cur, nums[j])
                <span style="font-weight: bold;">if</span> cur == k:
                    ans += 1
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>